src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Продажа/Forms/ФормаДокумента/Module.bsl
// @strict-types

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРасчета

// Расчет суммы.
// 
// Параметры:
//  СтрочкаДокумента - ДанныеФормыЭлементКоллекции -  Строка документа элементов формы
&НаКлиенте
Процедура РасчетСуммы(СтрочкаДокумента)
	
	СтрочкаДокумента.Сумма = СтрочкаДокумента.Количество * СтрочкаДокумента.Цена;

КонецПроцедуры



#КонецОбласти
